# Zone Geometric Definition Enumeration

Source: https://www.revitapidocs.com/2026/8a6cdc31-50fd-b7d2-ef85-4caeb3393708.htm

---

| Zone Geometric Definition Enumeration |
| --- |

An enumerated type listing possible geometric definition types for generic zones.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum ZoneGeometricDefinition
```

```
Public Enumeration ZoneGeometricDefinition
```

```
public enum class ZoneGeometricDefinition
```

```
type ZoneGeometricDefinition
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| Sketch | 0 | The zone geometry is defined by a sketch linework. |
| Spaces | 2 | The zone geometry is defined by a selection of MEP spaces. |

See Also

#### Reference

Autodesk.Revit.DB.Analysis Namespace